ParagPat20/Codes/Firmware/RollopodCodes/ESP32_Firmware/L_ESP32_SLAVE/L_ESP32_SLAVE.ino
/*
 * ESP32 Slave PCA9685 16-Channel Servo Controller & Closed-Loop Motor PID
 * (ESP-NOW Version)
 *
 * Controls up to 16 servos via PCA9685 PWM driver board.
 * Receives commands via ESP-NOW from master ESP32 (connected to PC).
 * Includes Closed-Loop PID Motor Speed Control & Active Zero-Speed Position
 * Hold using Quadrature Encoder on GPIO 1 (Encoder A) and GPIO 0 (Encoder B).
 *
 * Wiring:
 * ENCODER A  -> GPIO 1 (Input Pullup, Interrupt)
 * ENCODER B  -> GPIO 0 (Input Pullup, Interrupt)
 * MOSFET PIN -> GPIO 18 (IRL84132PBF 12V Rail Gate Control)
 * MOTOR PWM  -> GPIO 19 (MD13S PWM)
 * MOTOR DIR  -> GPIO 17 (MD13S DIR)
 * I2C SDA    -> GPIO 21 (PCA9685 & MPU6050 SDA)
 * I2C SCL    -> GPIO 22 (PCA9685 & MPU6050 SCL)
 */

#include <Adafruit_PWMServoDriver.h>
#include <ArduinoOTA.h>
#include <MPU6050_tockn.h>
#include <WiFi.h>
#include <Wire.h>
#include <esp_idf_version.h>
#include <esp_now.h>
#include <esp_wifi.h>

// ============================================================
// WIRELESS ARDUINOTA OVER-THE-AIR CONFIGURATION (SSID: MIBEE)
// ============================================================
bool otaModeActive = false;
const char *OTA_WIFI_SSID = "MIBEE";
const char *OTA_WIFI_PASS = ""; // Open Network (No Password)

void enableWirelessOTA(const char *hostname) {
  Serial.printf("\n[OTA] Switching to Wi-Fi STA mode and connecting to %s...\n", OTA_WIFI_SSID);
  WiFi.mode(WIFI_STA);
  WiFi.begin(OTA_WIFI_SSID, OTA_WIFI_PASS);

  unsigned long startAttempt = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startAttempt < 6000) {
    delay(250);
    Serial.print(".");
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("\n[OTA] Connected! IP Address: %s\n", WiFi.localIP().toString().c_str());
  } else {
    Serial.println("\n[OTA WARNING] Could not connect to MIBEE network within 6s");
  }

  ArduinoOTA.setHostname(hostname);
  ArduinoOTA.onStart([]() { Serial.println("[OTA] Wireless Update Starting..."); });
  ArduinoOTA.onEnd([]() { Serial.println("\n[OTA] Update Complete! Rebooting..."); });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    Serial.printf("[OTA] Progress: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    Serial.printf("[OTA] Error[%u]\n", error);
  });

  ArduinoOTA.begin();
  otaModeActive = true;
  Serial.printf("[OTA] Wireless ArduinoOTA Ready! Hostname: %s.local\n", hostname);
}

#define PCA9685_ADDRESS 0x40
#define TICK_MIN_DEFAULT 102
#define TICK_MAX_DEFAULT 512
#define SERVO_FREQ_DEFAULT 50

Adafruit_PWMServoDriver pca = Adafruit_PWMServoDriver(PCA9685_ADDRESS);

// ============================================================
// PIN ASSIGNMENTS (Seeed Studio XIAO ESP32-C6 / EasyEDA Schematic)
// ============================================================
#define ENCODER_A_PIN 1
#define ENCODER_B_PIN 0
#define MOSFET_PIN 18
#define MOTOR_PWM_PIN 19
#define MOTOR_DIR_PIN 17
#define I2C_SDA_PIN 21
#define I2C_SCL_PIN 22

// ============================================================
// QUADRATURE ENCODER & CLOSED-LOOP PID MOTOR CONTROLLER
// ============================================================
volatile long encoderTicks = 0;
volatile int encoderState = 0;

void IRAM_ATTR encoderISR() {
  int a = digitalRead(ENCODER_A_PIN);
  int b = digitalRead(ENCODER_B_PIN);
  int currState = (a << 1) | b;
  int sum = (encoderState << 2) | currState;

  if (sum == 0b1101 || sum == 0b0100 || sum == 0b0010 || sum == 0b1011)
    encoderTicks++;
  if (sum == 0b1110 || sum == 0b0111 || sum == 0b0001 || sum == 0b1000)
    encoderTicks--;

  encoderState = currState;
}

// Closed-Loop PID Parameters & Control Variables (Rhino IG32 Planetary Motor 9048 CPR @ 12V)
float Kp = 1.8f;
float Ki = 0.25f;
float Kd = 0.03f;
float encoderCPR = 9048.0f; // High Torque Quad Encoder CPR

bool closedLoopEnabled = true;
float targetRPM = 0.0f;
float measuredRPM = 0.0f;
long lastEncoderTicks = 0;
unsigned long lastPidTime = 0;

float pidIntegral = 0.0f;
float lastPidError = 0.0f;
long targetHoldPos = 0;
bool isHoldingPosition = false;
int currentMotorPWM = 0;

// Stall detection & thermal protection
unsigned long stallStartTime = 0;
bool stallDetected = false;
const unsigned long STALL_TIMEOUT_MS = 400;  // Cut output after 400ms stall
const int STALL_PWM_THRESHOLD = 60;          // PWM above this = actively trying to move
const float STALL_RPM_THRESHOLD = 2.0f;      // RPM below this = considered stalled

void setMotorHardwareSpeed(int speed) {
  speed = constrain(speed, -255, 255);
  currentMotorPWM = speed;
  if (speed == 0) {
    digitalWrite(MOTOR_DIR_PIN, LOW);
    analogWrite(MOTOR_PWM_PIN, 0);
  } else if (speed > 0) {
    digitalWrite(MOTOR_DIR_PIN, HIGH);
    analogWrite(MOTOR_PWM_PIN, speed);
  } else {
    digitalWrite(MOTOR_DIR_PIN, LOW);
    analogWrite(MOTOR_PWM_PIN, -speed);
  }
}

void updateClosedLoopControl() {
  unsigned long now = millis();
  float dt = (now - lastPidTime) / 1000.0f;
  if (dt < 0.02f)
    return; // 50Hz update loop (every 20ms)
  lastPidTime = now;

  long currentTicks;
  noInterrupts();
  currentTicks = encoderTicks;
  interrupts();

  long dTicks = currentTicks - lastEncoderTicks;
  lastEncoderTicks = currentTicks;

  // Calculate actual measured RPM from High-Resolution 9048 CPR Encoder (GPIO 0 & 1)
  measuredRPM = ((float)dTicks / encoderCPR) * (60.0f / dt);

  // Active Zero-Speed High-Resolution Encoder Position Lock (Degree-Scaled Instant Response)
  if (targetRPM == 0.0f) {
    if (!isHoldingPosition) {
      targetHoldPos = currentTicks;
      isHoldingPosition = true;
      pidIntegral = 0.0f;
      lastPidError = 0.0f;
      stallDetected = false;
      stallStartTime = 0;
    }

    long posError = targetHoldPos - currentTicks;

    // Deadband: 20 ticks (~0.8 deg) — avoids micro-corrections that heat the motor
    if (labs(posError) <= 20) {
      setMotorHardwareSpeed(0);
      pidIntegral = 0.0f;
      lastPidError = 0.0f;
      stallDetected = false;
      stallStartTime = 0;
      return;
    }

