ParagPat20/Codes/Firmware/RollopodCodes/ESP32_Firmware/L_ESP32_SLAVE/L_ESP32_SLAVE.ino
    // Convert encoder ticks error directly into degrees of rotation
    float degError = (float)posError / (encoderCPR / 360.0f);

    pidIntegral += degError * dt;
    pidIntegral = constrain(pidIntegral, -50.0f, 50.0f); // Anti-heating integral cap
    float dError = (degError - lastPidError) / dt;
    lastPidError = degError;

    float dirSign = (degError > 0) ? 1.0f : -1.0f;
    float baseFrictionPWM = dirSign * 35.0f; // Continuous breakaway threshold for 5kg wheel

    // High-sensitivity position counter-torque using GUI Kp, Ki, Kd gains on degrees of error!
    float outputPWM = baseFrictionPWM + (degError * Kp) + (pidIntegral * Ki) + (dError * Kd);
    outputPWM = constrain(outputPWM, -255.0f, 255.0f);

    // --- STALL DETECTION & THERMAL PROTECTION ---
    // If we're pushing hard but motor isn't moving = stall = dangerous heat buildup
    bool isStalling = (abs((int)outputPWM) >= STALL_PWM_THRESHOLD) &&
                      (fabs(measuredRPM) < STALL_RPM_THRESHOLD);
    if (isStalling) {
      if (stallStartTime == 0) {
        stallStartTime = now; // Start stall timer
      } else if ((now - stallStartTime) >= STALL_TIMEOUT_MS) {
        // Stalled too long — cut power to protect motor from overheating
        setMotorHardwareSpeed(0);
        stallDetected = true;
        // Snap hold position forward to reduce the error so we don't immediately retry
        targetHoldPos = currentTicks;
        pidIntegral = 0.0f;
        return;
      }
    } else {
      // Motor is moving — reset stall state
      stallStartTime = 0;
      stallDetected = false;
    }

    // Don't try again immediately after a stall — give motor 200ms cool-down
    if (stallDetected) {
      return;
    }

    setMotorHardwareSpeed((int)outputPWM);
    return;
  } else {
    isHoldingPosition = false;
    stallDetected = false;
    stallStartTime = 0;
  }

  if (!closedLoopEnabled) {
    setMotorHardwareSpeed((int)targetRPM);
    return;
  }

  // Closed-Loop Encoder Speed Control for Target RPM (With Feedforward for 100RPM/255PWM)
  float error = targetRPM - measuredRPM;
  pidIntegral += error * dt;
  pidIntegral = constrain(pidIntegral, -150.0f, 150.0f); // Anti-windup

  float dError = (error - lastPidError) / dt;
  lastPidError = error;

  float feedforwardPWM = targetRPM * 2.1f; // ~2.1 PWM units per RPM feedforward
  float outputPWM = feedforwardPWM + (Kp * error) + (Ki * pidIntegral) + (Kd * dError);
  outputPWM = constrain(outputPWM, -255.0f, 255.0f);

  setMotorHardwareSpeed((int)outputPWM);
}

void setupAntenna() {
#if defined(CONFIG_IDF_TARGET_ESP32C6) ||                                      \
    defined(ARDUINO_SEEED_XIAO_ESP32C6) || defined(ESP32C6)
  pinMode(3, OUTPUT);
  digitalWrite(3, LOW);
  delay(100);
  pinMode(14, OUTPUT);
  digitalWrite(14, LOW);
  Serial.println("[ANTENNA] XIAO ESP32-C6: Internal PCB Antenna Configured "
                 "(GPIO3=LOW, GPIO14=LOW)");
#else
  Serial.println("[ANTENNA] Standard ESP32 DevKit Board");
#endif
}

#ifndef LED_BUILTIN
#define LED_BUILTIN 15
#endif

unsigned long lastSlaveLedToggle = 0;
bool slaveLedState = false;
int slaveBurstToggles = 0;
unsigned long lastMasterCommandTime = 0;
const unsigned long MASTER_AVAILABLE_TIMEOUT_MS = 2500;

void updateSlaveLed() {
  unsigned long now = millis();

  // OTA Mode Active: Continuous Fast 15Hz Blinking (65ms toggle interval)
  if (otaModeActive) {
    if (now - lastSlaveLedToggle >= 65) {
      lastSlaveLedToggle = now;
      slaveLedState = !slaveLedState;
      digitalWrite(LED_BUILTIN, slaveLedState ? HIGH : LOW);
    }
    return;
  }

  if (slaveBurstToggles > 0) {
    if (now - lastSlaveLedToggle >= 35) {
      lastSlaveLedToggle = now;
      slaveLedState = !slaveLedState;
      digitalWrite(LED_BUILTIN, slaveLedState ? HIGH : LOW);
      slaveBurstToggles--;
    }
    return;
  }

  bool isMasterAvailable =
      (now - lastMasterCommandTime < MASTER_AVAILABLE_TIMEOUT_MS);

  if (!isMasterAvailable) {
    digitalWrite(LED_BUILTIN, LOW);
  } else {
    if (now - lastSlaveLedToggle >= 500) {
      lastSlaveLedToggle = now;
      slaveLedState = !slaveLedState;
      digitalWrite(LED_BUILTIN, slaveLedState ? HIGH : LOW);
    }
  }
}

#define MPU6050_ADDRESS 0x68
MPU6050 mpu(Wire);
bool mpuInitialized = false;
float accelAngle = 0.0;
float gyroAngle = 0.0;
float filteredAngle = 0.0;
unsigned long lastMpuUpdate = 0;

uint8_t masterMac[6];
bool hasMasterMac = false;
bool telemetryEnabled = true;
unsigned long lastTelemetryTime = 0;
const unsigned long TELEMETRY_INTERVAL = 100;

typedef struct cmd_struct {
  char text[128];
} cmd_struct;

typedef struct telemetry_struct {
  char type[10];
  char message[128];
  float pitch;
} telemetry_struct;

cmd_struct myCmd;
telemetry_struct myData;

struct ServoConfig {
  uint16_t tickMin;
  uint16_t tickMax;
  uint16_t currentTick;
  float lastAngle;
};

// Configured Standing Pose Angles for Left Slave (from rollopod_servo_profile.json)
const float DEFAULT_STANDING_ANGLES[16] = {
  128.0f,  // CH 00: Left Rear Coxa
  50.0f,   // CH 01: Left Rear Femur
  70.0f,   // CH 02: Left Rear Tibia
  90.0f,   // CH 03: Unassigned
  95.0f,   // CH 04: Left Middle Coxa
  15.0f,   // CH 05: Left Middle Femur
  70.0f,   // CH 06: Left Middle Patella
  160.0f,  // CH 07: Left Middle Tibia
  65.0f,   // CH 08: Left Front Coxa
  50.0f,   // CH 09: Left Front Femur
  70.0f,   // CH 10: Left Front Tibia
  90.0f,   // CH 11: Unassigned
  90.0f,   // CH 12: Unassigned
  90.0f,   // CH 13: Unassigned
  90.0f,   // CH 14: Unassigned
  90.0f    // CH 15: Unassigned
};

ServoConfig servoConfigs[16];
uint16_t pwmFrequency = SERVO_FREQ_DEFAULT;
String commandBuffer = "";

// ============================================================
// FORWARD DECLARATIONS
// ============================================================
void initESPNow();
#if defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 5)
void onDataRecv(const esp_now_recv_info *recvInfo, const uint8_t *data, int len);
#else
void onDataRecv(const uint8_t *srcMac, const uint8_t *data, int len);
#endif
void sendResponse(const char *response, const uint8_t *mac_addr);
void printMacAddress();
void setServoPWM(uint8_t channel, uint16_t tickValue);
void setServoAngle(uint8_t channel, float angle);
void setPWMFrequency(uint16_t freq);
void setCalibration(uint8_t channel, uint16_t minTick, uint16_t maxTick);
void setAllCalibrations(uint16_t minTick, uint16_t maxTick);
void getCalibration(uint8_t channel, const uint8_t *senderMac);
void getAllCalibrations(const uint8_t *senderMac);
void resetToDefaults();
void printInfo(const uint8_t *senderMac);
void processCommand(String command, const uint8_t *senderMac);

bool initMPU6050();
void updateMPU();
void setMotorSpeed(int speed);
void setTorque(int state);
void sendTelemetry();

