ParagPat20/Codes/Firmware/RollopodCodes/ESP32_Firmware/L_ESP32_SLAVE/L_ESP32_SLAVE.ino
// ============================================================
// TRIPOD WALKING GAIT STATE & PARAMETERS (Left Slave)
// ============================================================
enum GaitState {
  GAIT_IDLE,
  GAIT_FORWARD,
  GAIT_BACKWARD,
  GAIT_TURN_LEFT,
  GAIT_TURN_RIGHT
};

GaitState currentGaitState = GAIT_IDLE;
float gaitStrideAmp = 18.0f;     // Default Coxa stride amplitude in degrees
float gaitLiftAmp = 15.0f;       // Default Femur lift amplitude in degrees
float gaitFreqHz = 1.0f;         // Default gait frequency in Hz (1.0 Hz = 1000ms cycle)
unsigned long gaitStartTime = 0;
unsigned long lastGaitUpdate = 0;

void setGaitState(GaitState state, float stride = -1.0f, float lift = -1.0f, float freq = -1.0f) {
  if (stride > 0.0f) gaitStrideAmp = constrain(stride, 2.0f, 40.0f);
  if (lift > 0.0f)   gaitLiftAmp   = constrain(lift, 2.0f, 35.0f);
  if (freq > 0.0f)   gaitFreqHz    = constrain(freq, 0.2f, 4.0f);

  if (state == GAIT_IDLE) {
    currentGaitState = GAIT_IDLE;
    for (int i = 0; i < 16; i++) {
      setServoAngle(i, DEFAULT_STANDING_ANGLES[i]);
    }
  } else {
    currentGaitState = state;
    gaitStartTime = millis();
  }
}

void updateTripodGait() {
  if (currentGaitState == GAIT_IDLE) return;

  unsigned long now = millis();
  if (now - lastGaitUpdate < 20) return; // 50Hz update rate
  lastGaitUpdate = now;

  float cycleDurationMs = 1000.0f / gaitFreqHz;
  float elapsedMs = (float)((now - gaitStartTime) % (unsigned long)cycleDurationMs);
  float normalizedPhase = (elapsedMs / cycleDurationMs) * 2.0f * PI; // 0 to 2*PI

  // Direction multiplier for Left Side
  float dirMult = 1.0f;
  if (currentGaitState == GAIT_BACKWARD || currentGaitState == GAIT_TURN_LEFT) {
    dirMult = -1.0f; // Left side moves backward for reverse or CCW left rotation
  } else {
    dirMult = 1.0f;  // Left side moves forward for forward or CW right rotation
  }

  // --- Helper lambda for leg trajectory calculation ---
  auto computeLegPose = [&](float phaseOffset, float standCoxa, float coxaForwardSign,
                            float standFemur, float femurLiftSign,
                            float &outCoxa, float &outFemur) {
    float phi = fmod(normalizedPhase + phaseOffset, 2.0f * PI);
    if (phi < 0) phi += 2.0f * PI;

    float swingFactor = 0.0f;
    float liftFactor = 0.0f;

    if (phi < PI) {
      // SWING PHASE (in air: lift & swing forward)
      liftFactor  = sin(phi);          // 0 -> 1 -> 0
      swingFactor = -cos(phi);         // -1 (back) -> 0 -> +1 (forward)
    } else {
      // STANCE PHASE (on ground: push backward)
      liftFactor  = 0.0f;              // Foot firmly on ground
      swingFactor = cos(phi - PI);     // +1 (forward) -> 0 -> -1 (back)
    }

    outFemur = standFemur + (liftFactor * gaitLiftAmp * femurLiftSign);
    outCoxa  = standCoxa  + (swingFactor * gaitStrideAmp * coxaForwardSign * dirMult);
  };

  // 1. Left Front Leg (LF) -> Group A (Phase Offset = 0)
  // Coxa: CH 08 (stand 65°, forward sign = -1), Femur: CH 09 (stand 50°, lift sign = -1)
  float lfCoxa, lfFemur;
  computeLegPose(0.0f, DEFAULT_STANDING_ANGLES[8], -1.0f,
                       DEFAULT_STANDING_ANGLES[9], -1.0f,
                       lfCoxa, lfFemur);
  setServoAngle(8, lfCoxa);
  setServoAngle(9, lfFemur);

  // 2. Left Rear Leg (LR) -> Group A (Phase Offset = 0)
  // Coxa: CH 00 (stand 128°, forward sign = -1), Femur: CH 01 (stand 50°, lift sign = -1)
  float lrCoxa, lrFemur;
  computeLegPose(0.0f, DEFAULT_STANDING_ANGLES[0], -1.0f,
                       DEFAULT_STANDING_ANGLES[1], -1.0f,
                       lrCoxa, lrFemur);
  setServoAngle(0, lrCoxa);
  setServoAngle(1, lrFemur);

  // 3. Left Middle Leg (LM) -> Group B (Phase Offset = PI)
  // Coxa: CH 04 (stand 95°, forward sign = -1), Femur: CH 05 (stand 15°, lift sign = +1)
  float lmCoxa, lmFemur;
  computeLegPose(PI,   DEFAULT_STANDING_ANGLES[4], -1.0f,
                       DEFAULT_STANDING_ANGLES[5], +1.0f,
                       lmCoxa, lmFemur);
  setServoAngle(4, lmCoxa);
  setServoAngle(5, lmFemur);
}

void setup() {
  pinMode(LED_BUILTIN, OUTPUT);
  setupAntenna();

  pinMode(MOSFET_PIN, OUTPUT);
  digitalWrite(MOSFET_PIN, LOW);
  delay(100);

  pinMode(MOTOR_DIR_PIN, OUTPUT);
  pinMode(MOTOR_PWM_PIN, OUTPUT);
  digitalWrite(MOTOR_DIR_PIN, LOW);
  analogWrite(MOTOR_PWM_PIN, 0);

  // Configure Encoder Pins & Attach Interrupts (GPIO1 = Encoder A, GPIO0 = Encoder B)
  pinMode(ENCODER_A_PIN, INPUT_PULLUP);
  pinMode(ENCODER_B_PIN, INPUT_PULLUP);
  int initA = digitalRead(ENCODER_A_PIN);
  int initB = digitalRead(ENCODER_B_PIN);
  encoderState = (initA << 1) | initB;
  attachInterrupt(digitalPinToInterrupt(ENCODER_A_PIN), encoderISR, CHANGE);
  attachInterrupt(digitalPinToInterrupt(ENCODER_B_PIN), encoderISR, CHANGE);

  Serial.begin(115200);
#if defined(ARDUINO_USB_CDC_ON_BOOT) && (ARDUINO_USB_CDC_ON_BOOT == 1)
  Serial.setTxTimeoutMs(0);
#endif
  delay(500);

  Serial.println("\n\n========================================");
  Serial.println("ESP32-C6 Slave PCA9685 & Encoder PID Controller - ESP-NOW");
  Serial.println("========================================");

  initESPNow();

  Serial.print("\n*** SLAVE MAC ADDRESS: ");
  printMacAddress();
  Serial.println("*** Copy this MAC to master ESP32 sketch ***\n");

  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);

  Serial.println("Initializing MPU6050...");
  mpuInitialized = initMPU6050();
  if (mpuInitialized) {
    Serial.println("MPU6050 initialized successfully");
    lastMpuUpdate = millis();
  } else {
    Serial.println("ERROR: MPU6050 not found on I2C bus!");
  }

  Serial.println("Initializing PCA9685...");
  pca.begin();
  pca.setPWMFreq(SERVO_FREQ_DEFAULT);

  for (int i = 0; i < 16; i++) {
    servoConfigs[i].tickMin = TICK_MIN_DEFAULT;
    servoConfigs[i].tickMax = TICK_MAX_DEFAULT;
    servoConfigs[i].currentTick = (TICK_MIN_DEFAULT + TICK_MAX_DEFAULT) / 2;
    servoConfigs[i].lastAngle = DEFAULT_STANDING_ANGLES[i];
    setServoAngle(i, DEFAULT_STANDING_ANGLES[i]);
  }

  targetHoldPos = encoderTicks;
  isHoldingPosition = true;
  setMotorHardwareSpeed(0);

  Serial.println(
      "Slave initialization complete - waiting for ESP-NOW commands...");
}

void loop() {
  if (otaModeActive) {
    ArduinoOTA.handle();
  }

  if (mpuInitialized) {
    updateMPU();
  }

  // Update Closed-Loop PID & Active Zero-Speed Position Hold Controller (50Hz)
  updateClosedLoopControl();

  // Update On-Chip Tripod Walking Gait Controller (50Hz)
  updateTripodGait();

  if (telemetryEnabled && hasMasterMac &&
      (millis() - lastTelemetryTime >= TELEMETRY_INTERVAL)) {
    lastTelemetryTime = millis();
    sendTelemetry();
  }

  updateSlaveLed();
  delay(2);
}

void initESPNow() {
  WiFi.mode(WIFI_STA);
  WiFi.disconnect();
  if (esp_now_init() != ESP_OK) {
    Serial.println("ERROR: ESP-NOW initialization failed!");
    return;
  }
  Serial.println("ESP-NOW initialized successfully");
  esp_now_register_recv_cb(onDataRecv);
}

#if defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 5)
void onDataRecv(const esp_now_recv_info *recvInfo, const uint8_t *data,
                int len) {
  const uint8_t *srcMac = recvInfo->src_addr;
#else
void onDataRecv(const uint8_t *srcMac, const uint8_t *data, int len) {
#endif
  lastMasterCommandTime = millis();

