ParagPat20/Codes/Firmware/RollopodCodes/ESP32_Firmware/L_ESP32_SLAVE/L_ESP32_SLAVE.ino
  if (!hasMasterMac) {
    memcpy(masterMac, srcMac, 6);
    hasMasterMac = true;
    Serial.printf("Master MAC locked: %02X:%02X:%02X:%02X:%02X:%02X\n",
                  masterMac[0], masterMac[1], masterMac[2], masterMac[3],
                  masterMac[4], masterMac[5]);
  }

  if (len == sizeof(cmd_struct)) {
    cmd_struct *cmd = (cmd_struct *)data;
    String cmdText = String(cmd->text);
    cmdText.trim();
    if (cmdText != "PING") {
      slaveBurstToggles = 8; // 4 fast blinks (8 toggles) on receiving command
    }
    processCommand(cmdText, srcMac);
  } else {
    Serial.printf("Received invalid data length: %d (expected %d)\n", len,
                  sizeof(cmd_struct));
  }
}

void sendResponse(const char *response, const uint8_t *mac_addr) {
  if (!mac_addr)
    return;
  esp_now_peer_info_t peerInfo = {};
  memcpy(peerInfo.peer_addr, mac_addr, 6);
  peerInfo.channel = 0;
  peerInfo.encrypt = false;
  esp_now_add_peer(&peerInfo);

  memset(&myData, 0, sizeof(myData));
  strcpy(myData.type, "RESP");
  strncpy(myData.message, response, sizeof(myData.message) - 1);
  myData.pitch = filteredAngle;

  esp_now_send(mac_addr, (uint8_t *)&myData, sizeof(myData));
}

void printMacAddress() {
  uint8_t mac[6];
  WiFi.macAddress(mac);
  Serial.printf("%02X:%02X:%02X:%02X:%02X:%02X\n", mac[0], mac[1], mac[2],
                mac[3], mac[4], mac[5]);
}

void processCommand(String command, const uint8_t *senderMac) {
  command.trim();
  char responseBuffer[128];

  if (command == "PING") {
    sendResponse("PONG\n", senderMac);
  } else if (command == "OTA_MODE" || command == "ENTER_OTA") {
    enableWirelessOTA("rollopod-left-slave");
    sendResponse("OK: OTA Mode Enabled on Left Slave\n", senderMac);
  } else if (command.startsWith("TICK ")) {
    int space1 = command.indexOf(' ');
    int space2 = command.indexOf(' ', space1 + 1);
    if (space1 > 0 && space2 > space1) {
      int channel = command.substring(space1 + 1, space2).toInt();
      int tickValue = command.substring(space2 + 1).toInt();
      if (channel >= 0 && channel < 16 && tickValue >= 0 && tickValue <= 4095) {
        setServoPWM(channel, tickValue);
        snprintf(responseBuffer, sizeof(responseBuffer),
                 "OK: Channel %d set to %d ticks\n", channel, tickValue);
        sendResponse(responseBuffer, senderMac);
      } else {
        sendResponse("ERROR: Invalid channel (0-15) or tick value (0-4095)\n",
                     senderMac);
      }
    }
  } else if (command.startsWith("ANGLE ")) {
    int space1 = command.indexOf(' ');
    int space2 = command.indexOf(' ', space1 + 1);
    if (space1 > 0 && space2 > space1) {
      int channel = command.substring(space1 + 1, space2).toInt();
      float angle = command.substring(space2 + 1).toFloat();
      if (channel >= 0 && channel < 16 && angle >= 0.0 && angle <= 180.0) {
        setServoAngle(channel, angle);
        snprintf(responseBuffer, sizeof(responseBuffer),
                 "OK: Channel %d set to %.1f deg\n", channel, angle);
        sendResponse(responseBuffer, senderMac);
      } else {
        sendResponse("ERROR: Invalid channel (0-15) or angle (0-180)\n",
                     senderMac);
      }
    } else if (command.startsWith("ANGLE ALL ")) {
      float angle = command.substring(10).toFloat();
      if (angle >= 0.0 && angle <= 180.0) {
        for (int i = 0; i < 16; i++)
          setServoAngle(i, angle);
        snprintf(responseBuffer, sizeof(responseBuffer),
                 "OK: All 16 channels set to %.1f deg\n", angle);
        sendResponse(responseBuffer, senderMac);
      }
    }
  } else if (command == "STAND" || command == "STAND_POSE" || command == "HOME") {
    setGaitState(GAIT_IDLE);
    for (int i = 0; i < 16; i++) {
      setServoAngle(i, DEFAULT_STANDING_ANGLES[i]);
    }
    sendResponse("OK: Left Slave moved to Standing Pose\n", senderMac);
  } else if (command.startsWith("GAIT ") || command.startsWith("WALK_") || command.startsWith("TURN_")) {
    float stride = -1.0f, lift = -1.0f, speed = -1.0f;
    char subCmd[32] = {0};
    if (command.startsWith("GAIT ")) {
      sscanf(command.c_str() + 5, "%s %f %f %f", subCmd, &stride, &lift, &speed);
    } else {
      sscanf(command.c_str(), "%s %f %f %f", subCmd, &stride, &lift, &speed);
    }

    String sub = String(subCmd);
    sub.toUpperCase();

    if (sub == "FWD" || sub == "FORWARD" || sub == "WALK_FWD") {
      setGaitState(GAIT_FORWARD, stride, lift, speed);
      sendResponse("OK: Tripod Gait FORWARD\n", senderMac);
    } else if (sub == "BACK" || sub == "BACKWARD" || sub == "WALK_BACK") {
      setGaitState(GAIT_BACKWARD, stride, lift, speed);
      sendResponse("OK: Tripod Gait BACKWARD\n", senderMac);
    } else if (sub == "LEFT" || sub == "TURN_LEFT") {
      setGaitState(GAIT_TURN_LEFT, stride, lift, speed);
      sendResponse("OK: Tripod Gait TURN LEFT\n", senderMac);
    } else if (sub == "RIGHT" || sub == "TURN_RIGHT") {
      setGaitState(GAIT_TURN_RIGHT, stride, lift, speed);
      sendResponse("OK: Tripod Gait TURN RIGHT\n", senderMac);
    } else if (sub == "STOP" || sub == "IDLE" || sub == "STAND") {
      setGaitState(GAIT_IDLE);
      sendResponse("OK: Tripod Gait STOP (Returned to Stand)\n", senderMac);
    }
  } else if (command.startsWith("GAIT_CONFIG ")) {
    float stride = 18.0f, lift = 15.0f, freq = 1.0f;
    if (sscanf(command.c_str() + 12, "%f %f %f", &stride, &lift, &freq) >= 1) {
      if (stride > 0) gaitStrideAmp = constrain(stride, 2.0f, 40.0f);
      if (lift > 0)   gaitLiftAmp   = constrain(lift, 2.0f, 35.0f);
      if (freq > 0)   gaitFreqHz    = constrain(freq, 0.2f, 4.0f);
      snprintf(responseBuffer, sizeof(responseBuffer),
               "OK: Gait Config Stride=%.1f Lift=%.1f Freq=%.2fHz\n",
               gaitStrideAmp, gaitLiftAmp, gaitFreqHz);
      sendResponse(responseBuffer, senderMac);
    }
  } else if (command.startsWith("MOTOR ") || command.startsWith("RPM ")) {
    int spaceIdx = command.indexOf(' ');
    int speed = command.substring(spaceIdx + 1).toInt();
    if (speed >= -255 && speed <= 255) {
      targetRPM = (float)speed;
      if (targetRPM == 0.0f) {
        isHoldingPosition = false;
      }
      snprintf(responseBuffer, sizeof(responseBuffer),
               "OK: Motor target set to %d RPM (ClosedLoop=%s)\n", speed,
               closedLoopEnabled ? "ON" : "OFF");
      sendResponse(responseBuffer, senderMac);
    } else {
      sendResponse("ERROR: Speed must be between -255 and 255\n", senderMac);
    }
  } else if (command.startsWith("SET_PID ")) {
    float p = 0, i = 0, d = 0;
    if (sscanf(command.c_str() + 8, "%f %f %f", &p, &i, &d) == 3) {
      Kp = p;
      Ki = i;
      Kd = d;
      snprintf(responseBuffer, sizeof(responseBuffer),
               "OK: PID set to Kp=%.2f Ki=%.2f Kd=%.2f\n", Kp, Ki, Kd);
      sendResponse(responseBuffer, senderMac);
    } else {
      sendResponse("ERROR: Usage SET_PID <kp> <ki> <kd>\n", senderMac);
    }
  } else if (command.startsWith("SET_CPR ")) {
    float cpr = command.substring(8).toFloat();
    if (cpr > 0.0f) {
      encoderCPR = cpr;
      snprintf(responseBuffer, sizeof(responseBuffer),
               "OK: Encoder CPR set to %.1f\n", encoderCPR);
      sendResponse(responseBuffer, senderMac);
    }
  } else if (command.startsWith("CLOSED_LOOP ")) {
    int mode = command.substring(12).toInt();
    closedLoopEnabled = (mode != 0);
    snprintf(responseBuffer, sizeof(responseBuffer), "OK: Closed loop PID %s\n",
             closedLoopEnabled ? "ENABLED" : "DISABLED");
    sendResponse(responseBuffer, senderMac);
  } else if (command == "GET_ENCODER") {
    long currentTicks;
    noInterrupts();
    currentTicks = encoderTicks;
    interrupts();
    snprintf(responseBuffer, sizeof(responseBuffer),
             "ENCODER_DATA %ld %.1f %.1f\n", currentTicks, measuredRPM,
             targetRPM);
    sendResponse(responseBuffer, senderMac);
  } else if (command == "ENCODER_RESET") {
    noInterrupts();
    encoderTicks = 0;
    interrupts();
    targetHoldPos = 0;
    lastEncoderTicks = 0;
    sendResponse("OK: Encoder ticks reset to 0\n", senderMac);
  } else if (command.startsWith("TORQUE ")) {
    int state = command.substring(7).toInt();
    if (state == 0 || state == 1) {
      setTorque(state);
      snprintf(responseBuffer, sizeof(responseBuffer), "OK: Torque set to %s\n",
               state ? "HIGH" : "LOW");
      sendResponse(responseBuffer, senderMac);
    }
  } else if (command == "RESET_MPU") {
    gyroAngle = 0.0;
    if (mpuInitialized) {
      mpu.update();
      filteredAngle = atan2(mpu.getAccY(), mpu.getAccX()) * 180.0 / M_PI;
    } else {
      filteredAngle = 0.0;
    }
    sendResponse("OK: MPU6050 angles reset\n", senderMac);
  } else if (command == "GET_MPU") {
    if (!mpuInitialized) {
      sendResponse("ERROR: MPU6050 not initialized\n", senderMac);
    } else {
      char mpuBuffer[64];
      snprintf(mpuBuffer, sizeof(mpuBuffer), "MPU_DATA %.2f %.2f %.2f\n",
               filteredAngle, accelAngle, gyroAngle);
      sendResponse(mpuBuffer, senderMac);
    }
  } else if (command.startsWith("TELEMETRY ")) {
    int enable = command.substring(10).toInt();
    telemetryEnabled = (enable != 0);
    snprintf(responseBuffer, sizeof(responseBuffer), "OK: Telemetry %s\n",
             telemetryEnabled ? "ENABLED" : "DISABLED");
    sendResponse(responseBuffer, senderMac);
  } else if (command == "INFO") {
    printInfo(senderMac);
  } else {
    sendResponse("ERROR: Unknown command\n", senderMac);
  }
}

