ParagPat20/Codes/Firmware/RollopodCodes/ESP32_Firmware/L_ESP32_SLAVE/L_ESP32_SLAVE.ino
void setServoPWM(uint8_t channel, uint16_t tickValue) {
  if (channel >= 16 || tickValue > 4095)
    return;
  servoConfigs[channel].currentTick = tickValue;
  pca.setPWM(channel, 0, tickValue);
}

void setServoAngle(uint8_t channel, float angle) {
  if (channel >= 16 || angle < 0.0 || angle > 180.0)
    return;
  servoConfigs[channel].lastAngle = angle;
  uint16_t tickMin = servoConfigs[channel].tickMin;
  uint16_t tickMax = servoConfigs[channel].tickMax;
  float tickFloat = tickMin + (angle / 180.0) * (tickMax - tickMin);
  uint16_t tickValue = (uint16_t)(tickFloat + 0.5);
  if (tickValue < tickMin)
    tickValue = tickMin;
  if (tickValue > tickMax)
    tickValue = tickMax;
  if (tickValue > 4095)
    tickValue = 4095;
  setServoPWM(channel, tickValue);
}

void setPWMFrequency(uint16_t freq) {
  if (freq < 40 || freq > 1000)
    return;
  pwmFrequency = freq;
  pca.setPWMFreq(freq);
  for (int i = 0; i < 16; i++)
    setServoAngle(i, servoConfigs[i].lastAngle);
}

void setCalibration(uint8_t channel, uint16_t minTick, uint16_t maxTick) {
  if (channel >= 16 || minTick >= maxTick || maxTick > 4095)
    return;
  servoConfigs[channel].tickMin = minTick;
  servoConfigs[channel].tickMax = maxTick;
  setServoAngle(channel, servoConfigs[channel].lastAngle);
}

void setAllCalibrations(uint16_t minTick, uint16_t maxTick) {
  if (minTick >= maxTick || maxTick > 4095)
    return;
  for (int i = 0; i < 16; i++) {
    servoConfigs[i].tickMin = minTick;
    servoConfigs[i].tickMax = maxTick;
    setServoAngle(i, servoConfigs[i].lastAngle);
  }
}

void getCalibration(uint8_t channel, const uint8_t *senderMac) {
  if (channel >= 16)
    return;
  char buffer[128];
  snprintf(buffer, sizeof(buffer), "CAL_DATA %d %d %d\n", channel,
           servoConfigs[channel].tickMin, servoConfigs[channel].tickMax);
  sendResponse(buffer, senderMac);
}

void getAllCalibrations(const uint8_t *senderMac) {
  for (int i = 0; i < 16; i++)
    getCalibration(i, senderMac);
}

void resetToDefaults() {
  pwmFrequency = SERVO_FREQ_DEFAULT;
  pca.setPWMFreq(SERVO_FREQ_DEFAULT);
  for (int i = 0; i < 16; i++) {
    servoConfigs[i].tickMin = TICK_MIN_DEFAULT;
    servoConfigs[i].tickMax = TICK_MAX_DEFAULT;
    servoConfigs[i].currentTick = (TICK_MIN_DEFAULT + TICK_MAX_DEFAULT) / 2;
    servoConfigs[i].lastAngle = DEFAULT_STANDING_ANGLES[i];
    setServoAngle(i, DEFAULT_STANDING_ANGLES[i]);
  }
}

void printInfo(const uint8_t *senderMac) {
  char buffer[128];
  snprintf(buffer, sizeof(buffer), "=== ESP32 Slave PCA9685 Info ===\n");
  sendResponse(buffer, senderMac);
  delay(10);
  snprintf(buffer, sizeof(buffer), "PWM Frequency: %d Hz\n", pwmFrequency);
  sendResponse(buffer, senderMac);
  delay(10);
  snprintf(buffer, sizeof(buffer),
           "Closed Loop PID: %s (Kp=%.2f Ki=%.2f Kd=%.2f)\n",
           closedLoopEnabled ? "ENABLED" : "DISABLED", Kp, Ki, Kd);
  sendResponse(buffer, senderMac);
  delay(10);
}

bool initMPU6050() {
  mpu.begin();
  Serial.println("Calculating gyro offsets, keep the robot still...");
  mpu.calcGyroOffsets(true);
  Serial.println("Offsets calculated!");
  return true;
}

void updateMPU() {
  unsigned long now = millis();
  float dt = (now - lastMpuUpdate) / 1000.0;
  lastMpuUpdate = now;
  if (dt <= 0.0)
    dt = 0.001;

  mpu.update();
  float accX = mpu.getAccX();
  float accY = mpu.getAccY();
  accelAngle = atan2(accY, accX) * 180.0 / M_PI;
  float gyroRate = mpu.getGyroZ();
  gyroAngle += gyroRate * dt;
  filteredAngle = 0.98 * (filteredAngle + gyroRate * dt) + 0.02 * accelAngle;
}

void setMotorSpeed(int speed) {
  targetRPM = (float)speed;
  if (targetRPM == 0.0f) {
    isHoldingPosition = false;
  }
}

void setTorque(int state) { digitalWrite(MOSFET_PIN, state ? HIGH : LOW); }

void sendTelemetry() {
  if (!hasMasterMac)
    return;

  esp_now_peer_info_t peerInfo = {};
  memcpy(peerInfo.peer_addr, masterMac, 6);
  peerInfo.channel = 0;
  peerInfo.encrypt = false;
  esp_now_add_peer(&peerInfo);

  memset(&myData, 0, sizeof(myData));
  strcpy(myData.type, "MPU");
  myData.pitch = filteredAngle;

  long currentTicks;
  noInterrupts();
  currentTicks = encoderTicks;
  interrupts();
  snprintf(myData.message, sizeof(myData.message), "ENC %ld %.1f %.1f %d",
           currentTicks, measuredRPM, targetRPM, currentMotorPWM);

  esp_now_send(masterMac, (uint8_t *)&myData, sizeof(myData));
}
